{"pages":[{"title":"about","text":"Who are we?We are a team of 4 developers who have already several years of experience of windows kernel programming. What are our role?We are aiming to provide cheat developers with various tools to help them building a cheat, such as ring0 driver, debug tools, cheat protecting and selling system and so on. So our roles is helping you to conquer the hardest part of building a cheat - bypass the anti-cheat system and help you to protect you cheat from cracking.","link":"/about/"},{"title":"HomePage","text":"Welcome to God Creator Pub! This is our home page.","link":"/homepage/"},{"title":"Products","text":"Our products GC_Driver: this one is a ring0 driver which can bypass the anti-cheat system and help you to read the game data in the internal and external way safely. And we will provide a demo of reading apex data in those way to help you to use our driver quickly. Our driver also includes some other utility, as follows: Protecting process: in this way, your cheat can bypass the pattern scanning of anti-cheat system. Changing mouse and keyboard input from kernel. Debuger Plugin(Coming soon): this one can let your debug tools-like x64dbg, ClassNet and Cheat engine-to pass the anti-cheat system. In this way, you can use those tools to get what data offsets that you want to get. Cheat protecting and selling system(Coming soon): This one can provide a serious protecting functions–like anti-debug, obfuscating code and so on. Besides, we also provide you with a licensing library for selling cheat. Hwid spoofer(Coming soon)","link":"/products/"}],"posts":[{"title":"Introduction and Usage of GC Driver","text":"Introduction//Todo Usage1. Get the module_base address The brief of GC_driver api1api define: Todo Example 2. Get the address offset of the dataRead Or Write MemoryFirst.","link":"/2021/05/08/Introduction%20and%20Usage%20of%20GC%20Driver/"}],"tags":[],"categories":[{"name":"gc_driver","slug":"gc-driver","link":"/categories/gc-driver/"}]}